
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="zh_cn">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   
      <title>1.1.&nbsp;Greasemonkey &#26159;&#20160;&#20040;&#65311; [&#28145;&#20837;&#27973;&#20986; Greasemonkey]</title>
      <link rel="shortcut icon" href="/favicon.ico">
      <link rel="stylesheet" href="../css/dig.css" type="text/css">
      <meta http-equiv="Link" content='&lt;../css/modern.css&gt;; type="text/css"; rel=stylesheet, &lt;../css/empty.css&gt;; type="text/css";
      rel=stylesheet'>
      <link rev="made" href="mailto:mark@diveintomark.org">
      <meta name="generator" content="DocBook XSL Stylesheets V1.68.1">
      <meta name="keywords" content="Firefox, Greasemonkey, Javascript, user script, userscript">
      <link rel="start" href="../toc/index.html" title="&#28145;&#20837;&#27973;&#20986; Greasemonkey">
      <link rel="up" href="index.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#24320;&#22987;">
      <link rel="prev" href="index.html" title="&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#24320;&#22987;">
      <link rel="next" href="greasemonkey.html" title="1.2.&nbsp;&#23433;&#35013; Greasemonkey">
   </head>
   <body id="diveintogreasemonkey-org" class="basic-what">
      <div class="z" id="intro">
         <div class="sectionInner">
            <div class="sectionInner2">
               <div class="s">
                  <h1><a href="/" accesskey="1">&#28145;&#20837;&#27973;&#20986; Greasemonkey</a></h1>
                  <p>&#25945;&#32769;&#32593;&#32476;&#23398;&#26032;&#25226;&#25103;</p>
               </div>
               <div class="s">
                  <ul>
                     <li><a href="../">&#36215;&#22987;&#39029;</a> &middot; 
                     </li>
                     <li><a href="../toc/">&#30446;&#24405;</a> &middot; 
                     </li>
                     <li><a href="../download/">&#19979;&#36733;</a> &middot; 
                     </li>
                     <li><a href="http://greasemonkey.mozdev.org/">&#31435;&#21363;&#19979;&#36733; Greasemonkey</a></li>
                  </ul>
               </div>
            </div>
         </div>
      </div>
      <div id="main">
         <div id="mainInner">
            <p id="breadcrumb">&#24744;&#30340;&#20301;&#32622;&#65306;<a href="../">&#36215;&#22987;&#39029;</a> &#8594; <a href="../toc/index.html">&#30446;&#24405;</a> &#8594; <a href="index.html">&#24320;&#22987;</a> &#8594; <span class="thispage">Greasemonkey &#26159;&#20160;&#20040;&#65311;</span></p>
            <div class="section" lang="zh_cn">
               <div class="titlepage">
                  <div>
                     <div>
                        <h2 class="title"><a name="basic.what" class="skip" href="#basic.what" title="link to this section"><img src="../images/permalink.gif" alt="[link]" title="link to this section" width="8" height="9"></a> 1.1.&nbsp;Greasemonkey &#26159;&#20160;&#20040;&#65311;
                        </h2>
                     </div>
                     <div>
                        <div class="abstract">
                           <h3 class="title"></h3>
                           <p>Greasemonkey &#26159;&#19968;&#20010; Firefox &#25193;&#23637;&#65292;&#23427;&#20855;&#26377;&#36890;&#36807;&#32534;&#20889;&#33050;&#26412;&#26469;&#25913;&#21464;&#34987;&#35775;&#38382;&#32593;&#39029;&#30340;&#21151;&#33021;&#12290;&#20351;&#29992;&#23427;&#65292;&#33021;&#20351;&#24744;&#35775;&#38382;&#30340;&#32593;&#31449;&#26356;&#20415;&#20110;&#38405;&#35835;&#25110;&#32773;&#26356;&#20415;&#20110;&#20351;&#29992;&#12290;&#20351;&#29992;&#23427;&#65292;&#24744;&#33021;&#20462;&#22797;&#32593;&#39029;&#28210;&#26579;&#30340;&#32570;&#38519;&#65292;&#32780;&#26080;&#39035;&#28902;&#25200;&#32593;&#31449;&#31649;&#29702;&#21592;&#12290;&#20351;&#29992;&#23427;&#65292;&#24744;&#33021;&#35753;&#32593;&#39029;&#26356;&#22909;&#22320;&#20351;&#29992;&#27531;&#30142;&#20154;&#25588;&#21161;&#25216;&#26415;&#65292;&#28165;&#26970;&#21709;&#20142;&#22320;&#35828;&#20986;&#32593;&#39029;&#20869;&#23481;&#65292;&#25110;&#32773;&#23558;&#32593;&#39029;&#20869;&#23481;&#21464;&#20026;&#30450;&#25991;&#12290;&#20351;&#29992;&#23427;&#65292;&#24744;&#33021;&#33258;&#21160;&#22320;&#33719;&#24471;&#20854;&#23427;&#32593;&#31449;&#30340;&#25968;&#25454;&#65292;&#20174;&#32780;&#20351;&#20004;&#20010;&#32593;&#31449;&#26356;&#22909;&#22320;&#30456;&#20114;&#38142;&#25509;&#36215;&#26469;&#12290;</p>
                        </div>
                     </div>
                  </div>
               </div>
               <p>&#28982;&#32780; Greasemonkey &#26412;&#36523;&#24182;&#27809;&#26377;&#20316;&#36825;&#20123;&#20107;&#12290;&#23454;&#38469;&#19978;&#65292;&#22312;&#24744;&#23433;&#35013;&#23427;&#20043;&#21518;&#65292;&#24744;&#27880;&#24847;&#21040;&#26681;&#26412;&#27809;&#26377;&#20219;&#20309;&#21464;&#21160;...&#30452;&#21040;&#24744;&#24320;&#22987;&#23433;&#35013;&#19968;&#31181;&#21483;&#20570;&#8220;<span class="quote">&#29992;&#25143;&#33050;&#26412;</span>&#8221;&#30340;&#19996;&#35199;&#12290;&#29992;&#25143;&#33050;&#26412;(user script)&#23601;&#26159;&#19968;&#22823;&#22359; Javascript &#20195;&#30721;&#65292;&#36824;&#26377;&#20123;&#38468;&#21152;&#20449;&#24687;&#65292;&#29992;&#26469;&#21578;&#35785; Greasemonkey &#33050;&#26412;&#24212;&#35813;&#22312;&#20309;&#26102;&#20309;&#22320;&#36816;&#34892;&#12290;&#27599;&#20010;&#29992;&#25143;&#33050;&#26412;&#33021;&#22815;&#38024;&#23545;&#20855;&#20307;&#39029;&#38754;&#65292;&#20855;&#20307;&#32593;&#31449;&#65292;&#25110;&#32773;&#19968;&#25209;&#32593;&#31449;&#12290;&#29992;&#25143;&#33050;&#26412;&#33021;&#20570;&#21040;&#24744;&#22312; Javascript
                  &#20013;&#21487;&#20570;&#21040;&#30340;&#20219;&#20309;&#20107;&#24773;&#12290;&#23454;&#38469;&#19978;&#65292;&#23427;&#33021;&#20570;&#24471;&#26356;&#22810;&#65292;&#22240;&#20026; Greasemonkey &#25552;&#20379;&#20102;&#19987;&#20379;&#29992;&#25143;&#33050;&#26412;&#20351;&#29992;&#30340;&#20989;&#25968;&#12290;
               </p>
               <p>&#36825;&#37324;&#26159;<a href="http://dunck.us/collab/GreaseMonkeyUserScripts">Greasemonkey &#33050;&#26412;&#24211;</a>&#21547;&#20102;&#19978;&#30334;&#20010;&#29992;&#25143;&#33050;&#26412;&#65292;&#36825;&#20123;&#37117;&#26159;&#29992;&#25143;&#20026;&#20102;&#28385;&#36275;&#33258;&#24049;&#30340;&#38656;&#35201;&#32780;&#20889;&#30340;&#12290;&#19968;&#26086;&#24744;&#20889;&#20102;&#33258;&#24049;&#30340;&#29992;&#25143;&#33050;&#26412;&#65292;&#21482;&#35201;&#24744;&#35748;&#20026;&#21035;&#20154;&#20063;&#35768;&#21457;&#29616;&#23427;&#26377;&#29992;&#65292;&#24744;&#21487;&#20197;&#25226;&#23427;&#28155;&#21152;&#21040;&#33050;&#26412;&#24211;&#20013;&#12290;&#24744;&#20063;&#21487;&#20197;&#33258;&#24049;&#20351;&#29992;&#65292;&#22240;&#20026;&#20174;&#32534;&#20889;&#36807;&#31243;&#20013;&#33719;&#24471;&#30693;&#35782;&#65292;&#33719;&#24471;&#28385;&#36275;&#24863;&#65292;&#25165;&#26159;&#26356;&#37325;&#35201;&#30340;&#12290;
               </p>
               <p>&#36825;&#26159;<a href="http://greasemonkey.mozdev.org/list.html">Greasemonkey &#30340;&#37038;&#20214;&#21015;&#34920;</a>&#65292;&#24744;&#21487;&#20197;&#22312;&#37027;&#37324;&#25552;&#38382;&#65292;&#21457;&#34920;&#29992;&#25143;&#33050;&#26412;&#65292;&#21644;&#35752;&#35770;&#26032;&#29305;&#24615;&#30340;&#24819;&#27861;&#12290;Greasemonkey &#24320;&#21457;&#20154;&#21592;&#24120;&#21435;&#36825;&#20010;&#37038;&#20214;&#21015;&#34920;; &#20182;&#20204;&#20063;&#35768;&#20250;&#22238;&#31572;&#24744;&#30340;&#38382;&#39064;!
               </p>
               <h3><a name="d0e294" class="skip" href="#d0e294" title="link to this bridgehead"><img src="../images/permalink.gif" alt="[link]" title="link to this bridgehead" width="8" height="9"></a> &#20026;&#20160;&#20040;&#20889;&#36825;&#26412;&#20070;&#65311;
               </h3>
               <p>&#28145;&#20837;&#27973;&#20986; Greasemonkey &#26159;&#20174; Greasemonkey &#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#29992;&#25143;&#35752;&#35770;&#21644;&#20316;&#32773;&#26412;&#20154;&#32534;&#20889;&#29992;&#25143;&#33050;&#26412;&#30340;&#32463;&#39564;&#20013;&#21457;&#23637;&#32780;&#26469;&#12290;&#20165;&#20165;&#19968;&#20010;&#26143;&#26399;&#65292;&#20316;&#32773;&#23601;&#21457;&#29616;&#65292;&#26032;&#29992;&#25143;&#32463;&#24120;&#20250;&#25552;&#20986;&#37325;&#22797;&#30340;&#38382;&#39064;&#65292;&#32780;&#36825;&#20123;&#38382;&#39064;&#26159;&#34987;&#22238;&#31572;&#36807;&#30340;&#12290;&#27492;&#22806;&#65292;&#22312;&#20889;&#20102;&#20960;&#20010;&#29992;&#25143;&#33050;&#26412;&#20197;&#21518;&#65292;&#20316;&#32773;&#21457;&#29616;&#65292;&#19968;&#20123;&#24120;&#29992;&#30340;&#27169;&#24335;&#65292;&#20197;&#21450;&#21487;&#20197;&#35299;&#20915;&#26576;&#19968;&#31867;&#38382;&#39064;&#30340;&#25104;&#22359;&#30340;&#21487;&#37325;&#29992;&#20195;&#30721;&#20250;&#21453;&#22797;&#20986;&#29616;&#12290;&#22240;&#27492;&#65292;&#20316;&#32773;&#24320;&#22987;&#25972;&#29702;&#36825;&#20123;&#26377;&#29992;&#30340;&#27169;&#24335;&#65292;&#35299;&#37322;&#32534;&#31243;&#24605;&#36335;&#65292;&#21516;&#26102;&#20316;&#32773;&#20063;&#20174;&#20013;&#20889;&#20316;&#20013;&#24471;&#21040;&#19981;&#23569;&#38203;&#28860;&#12290;</p>
               <p>&#22914;&#26524;&#27809;&#26377; Greasemonkey &#30340;&#24320;&#21457;&#32773; Aaron Boodman &#21644; Jeremy Dunck &#30340;&#22823;&#21147;&#24110;&#21161;&#65292;&#27809;&#26377;&#37027;&#20123;&#23545;&#25105;&#30340;&#21021;&#31295;&#25552;&#20986;&#23453;&#36149;&#30340;&#21453;&#39304;&#24314;&#35758;&#30340;&#29992;&#25143;&#65292;&#23601;&#19981;&#20250;&#26377;&#29616;&#22312;&#30340;&#36825;&#26412;&#20070;&#12290;&#35874;&#35874;&#22823;&#23478;&#12290;</p>
            </div>
            <div style="float: left">&#8592;&nbsp;<a class="NavigationArrow" href="index.html">&#24320;&#22987;</a></div>
            <div style="text-align: right"><a class="NavigationArrow" href="greasemonkey.html">&#23433;&#35013; Greasemonkey</a>&nbsp;&#8594;
            </div>
            <hr style="clear:both">
            <div class="footer">
               <p class="copyright">&#29256;&#26435; &copy; 2005 Mark Pilgrim &middot; <a title="&#21457;&#36865;&#32473;&#25105;&#26377;&#20110;&#27492;&#20070;&#30340;&#21453;&#39304;&#24847;&#35265;" href="mailto:mark@diveintomark.org">mark@diveintomark.org</a> &middot; <a href="../license/gpl.html" title="GNU &#36890;&#29992;&#20844;&#20849;&#35768;&#21487;&#35777;">&#20351;&#29992;&#26465;&#27454;</a></p>
            </div>
         </div>
      </div>
   </body>
</html>